//Надо показать намерения этого кода для чего он написан именно так
//Возможно в коде будут вещи неясные постороннему, и изменить их имена нельзя, так как это часть библеотеки или нет прав менять код, тогда можно прояснить все коментарием
//TODO коментарии сообщают о вещах которые нужно будет сделать в будущем после завершения других
//Коментарии усиления показывают важность некоторых деталей или обращают внимание на последствия некоторых функций. Вроде она может поменять ссылку или опустошить массив
//Избыточность коминтарие плоха. Не стоит пояснять работу элементарных фунций, где итак все на поверхности

int main()
{

  return 0;
}
